{
    "Name": "Mushroom Miso Udon",
    "Image": "",
    "Link": "https://www.cookerru.com/creamy-mushroom-miso-udon/#wprm-recipe-container-8993",
    "Time": {
        "Prep Time": "5 mins",
        "Cook Time": "10 mins",
        "Total Time": "15 mins"
    },
    "Servings": "2",
    "Ingredients": [
        "2 servings (500g) udon noodles preferably frozen (see notes below)",
        "3 tbsp butter",
        "4 cloves garlic minced",
        "1/2 medium onion sliced",
        "200 g mushrooms of your choice, i used shiitake and golden enoki",
        "1 tbsp oyster sauce or soy sauce",
        "1 cup heavy cream or evaporated milk",
        "2 tbsp miso paste white or red (see notes below)",
        "green onion, furikake, egg, and/or shredded nori for garnish"
    ],
    "Instructions": [
        "To prepare your noodles from frozen, soak them in hot water for about a minute, and use a pair of chopsticks to carefully loosen the noodles. Rinse with cold water, drain, and set aside.",
        "Heat butter over medium heat, until completely melted and bubbling. Add onion and garlic and cook for about 2 minutes, or until fragrant. Stir in the mushrooms.",
        "Add about 2-3 tbsp of water and oyster sauce to the pan and sauté for a few minutes until the mushrooms are cooked through.",
        "Add heavy cream and miso paste, and mix to combine. Bring the sauce to a boil, add the noodles and toss until evenly coated. Season with salt and pepper to taste, garnish, and enjoy!"
    ],
    "Notes": [
        "If you prefer your dish to be more brothy: you can add about 1/4 cup of chicken stock (or more) along with the heavy cream to thin out the sauce. Please feel free to adjust the consistency to your liking!",
        "* Using frozen udon noodles is recommended for this recipe as they store for months in the freezer, and I found that the frozen kind is actually more ideal for stir-fries. Frozen udon noodles often have a nice chewy texture, and are less prone to getting mushy and overcooked when stir-frying.", 
        "Miso paste: both white and red miso paste will work, with slightly different results. If you prefer the miso to be milder in taste with a touch of sweetness I recommend using white miso (shiro miso), but if you prefer the flavors of the miso to be a bit stronger, I suggest using the red miso paste (aka miso)." 
    ]
}